bender2333/x-protocal/Third_Party/GD32F/gd32-secure-boot-secure-firmware-update/Platform/GD32A513/Firmware/GD32A513_standard_peripheral/Source/gd32a513_fmc.c
            /* enable the option bytes programming */
            FMC_CTL1 |= FMC_CTL1_OB0PG;

            /* write option bytes */
            for(i = 0U; i < OB_DOUBLEWORD_CNT; i++) {
                OP_BYTE(i * 2U) = op_byte[i * 2U];
                OP_BYTE(i * 2U + 1U) = op_byte[i * 2U + 1U];
                fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY != fmc_state) {
                    break;
                }
            }

            /* wait for the FMC ready */
            fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);

            /* reset the OB0PG bit */
            FMC_CTL1 &= ~FMC_CTL1_OB0PG;
        } else {
            /* reset the OB0ER bit */
            FMC_CTL1 &= ~FMC_CTL1_OB0ER;
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program the FMC data option bytes 0
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_data: the data to be programmed, OB_DATA[0:15]
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: BOR/POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum ob_data_program(uint16_t ob_data)
{
    uint32_t i;
    uint32_t val;
    uint32_t op_byte[OB_WORD_CNT] = {0U};
    fmc_state_enum fmc_state = FMC_READY;

    val = OB_SPC;
    /* check the option bytes security protection value */
    if(OB_OBSTAT_PLEVEL_HIGH == ob_plevel_get()) {
        return FMC_OB_HSPC;
    }

    /* read option bytes */
    for(i = 0U; i < OB_WORD_CNT; i++) {
        op_byte[i] = OP_BYTE(i);
    }

    val = (uint32_t)(ob_data & LOW_8BITS_MASK);
    val |= ((uint32_t)ob_data & HIGH_8BITS_MASK) << 8U;
    op_byte[1] = val;
    /* wait for the FMC ready */
    fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* start erase the option bytes */
        FMC_CTL1 |= FMC_CTL1_OB0ER;
        FMC_CTL1 |= FMC_CTL1_START;

        /* wait for the FMC ready */
        fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {
            /* reset the OB0ER bit */
            FMC_CTL1 &= ~FMC_CTL1_OB0ER;
            /* set the OB0PG bit */
            FMC_CTL1 |= FMC_CTL1_OB0PG;

            /* write option bytes */
            for(i = 0U; i < OB_DOUBLEWORD_CNT; i++) {
                OP_BYTE(i * 2U) = op_byte[i * 2U];
                OP_BYTE(i * 2U + 1U) = op_byte[i * 2U + 1U];
                fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY != fmc_state) {
                    break;
                }
            }
            /* wait for the FMC ready */
            fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);

            /* reset the OB0PG bit */
            FMC_CTL1 &= ~FMC_CTL1_OB0PG;
        } else {
            /* reset the OB0ER bit */
            FMC_CTL1 &= ~FMC_CTL1_OB0ER;
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      get the value of FMC option bytes OB_USER in FMC_OBSTAT register
    \param[in]  none
    \param[out] none
    \retval     the option bytes USER value
*/
uint8_t ob_user_get(void)
{
    return (uint8_t)((FMC_OBSTAT & FMC_OBSTAT_USER) >> OBSTAT_USER_OFFSET);
}

/*!
    \brief      get the value of FMC option bytes OB_DATA in FMC_OBSTAT register
    \param[in]  none
    \param[out] none
    \retval     the option bytes DATA value
*/
uint16_t ob_data_get(void)
{
    return (uint16_t)((FMC_OBSTAT & FMC_OBSTAT_DATA) >> OBSTAT_DATA_OFFSET);
}

/*!
    \brief      get the value of FMC option bytes BK0WP in FMC_WP0 register
    \param[in]  none
    \param[out] none
    \retval     the option bytes BK0WP value
*/
uint32_t ob_write_protection_get(void)
{
    return (uint32_t)(FMC_WP0);
}

/*!
    \brief      get the value of FMC option bytes BK1WP in FMC_WP1 register
    \param[in]  none
    \param[out] none
    \retval     the option bytes BK1WP value
*/
uint8_t ob_bk1_write_protection_get(void)
{
    return (uint8_t)((FMC_WP1 & FMC_WP1_BK1WP) >> WP1_BK1WP_OFFSET);
}

/*!
    \brief      get the value of FMC option bytes DFWP in FMC_WP1 register
    \param[in]  none
    \param[out] none
    \retval     the option bytes DFWP value
*/
uint8_t ob_df_write_protection_get(void)
{
    return (uint8_t)((FMC_WP1 & FMC_WP1_DFWP) >> WP1_DFWP_OFFSET);
}

/*!
    \brief      get the value of FMC option bytes EPWP in FMC_WP1 register
    \param[in]  none
    \param[out] none
    \retval     the option bytes EPWP value
*/
uint8_t ob_ep_write_protection_get(void)
{
    return (uint8_t)((FMC_WP1 & FMC_WP1_EPWP) >> WP1_EPWP_OFFSET);
}

/*!
    \brief      get the value of FMC option bytes 0 security protection level (PLEVEL) in FMC_OBSTAT register
    \param[in]  none
    \param[out] none
    \retval     the value of PLEVEL
      \arg        OB_OBSTAT_PLEVEL_NO: no security protection
      \arg        OB_OBSTAT_PLEVEL_LOW: low security protection
      \arg        OB_OBSTAT_PLEVEL_HIGH: high security protection
*/
uint8_t ob_plevel_get(void)
{
    return (uint8_t)((FMC_OBSTAT & FMC_OBSTAT_PLEVEL) >> OBSTAT_PLEVEL_OFFSET);
}

/*!
    \brief      configure lock value in option bytes 1
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  lk_value: the LK value to be programmed (OB1_LK_VALUE)
                only one parameter can be selected which is shown as below:
      \arg        OB1CS_OB1_LK: when configured as OB1CS_OB1_LK, the option bytes 1 cannot be modified any more
      \arg        OB1CS_OB1_NOT_LK: option bytes 1 is not locked
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: BOR/POR or system reset during flash erase/program error
      \arg        FMC_OB1_LK: option bytes 1 is locked
*/
fmc_state_enum ob1_lock_config(uint32_t lk_value)
{
    uint32_t reg;

    /* check the option bytes 1 lock status */
    if(0U != (FMC_OB1CS & FMC_OB1CS_OB1LK)) {
        return FMC_OB1_LK;
    }

    reg = FMC_OB1CS;
    reg &= ~FMC_OB1CS_LKVAL;
    reg |= lk_value;

    /* wait for the FMC ready */
    fmc_state_enum fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* write the value to LKVAL in FMC_OB1CS register */
        FMC_OB1CS = reg;

        /* set the OB1START bit */
        FMC_OB1CS |= FMC_OB1CS_OB1START;

        /* wait for the FMC ready */
        fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure the EPLOAD value of option bytes 1 loaded after the system reset
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  epload: EPLOAD value to be programmed
                only one parameter can be selected which is shown as below:
      \arg        OB1CS_EPLOAD_NOT_LOAD_EPDATA: shared SRAM is not loaded with valid EEPROM data during FMC reset
      \arg        OB1CS_EPLOAD_LOAD_EPDATA: shared SRAM is loaded with valid EEPROM data during FMC reset
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: BOR/POR or system reset during flash erase/program error
      \arg        FMC_RSTERR: BOR/POR or system reset during flash erase/program error
      \arg        FMC_OB1_LK: option bytes 1 is locked
*/
fmc_state_enum ob1_epload_config(uint32_t epload)
{
    uint32_t reg;
    fmc_state_enum fmc_state = FMC_READY;

    /* check the option bytes 1 lock status */
    if(0U != (FMC_OB1CS & FMC_OB1CS_OB1LK)) {
        return FMC_OB1_LK;
    }

    reg = FMC_OB1CS;
    reg &= ~FMC_OB1CS_EPLOAD;
    reg |= epload;

    fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* write the value to EPLOAD in FMC_OB1CS register */
        FMC_OB1CS = reg;

        /* set the OB1START bit */
        FMC_OB1CS |= FMC_OB1CS_OB1START;

        /* wait for the FMC ready */
        fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the OB1START bit */
        FMC_OB1CS &= ~FMC_OB1CS_OB1START;
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure option bytes 1 EEPROM parameters
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  efalc: EFALC value to be programmed
                only one parameter can be selected which is shown as below:
      \arg        OB1CS_DF_64K_EF_0K: data flash size is 64KB, EEPROM backup size is 0KB
      \arg        OB1CS_DF_48K_EF_16K: data flash size is 48KB, EEPROM backup size is 16KB
      \arg        OB1CS_DF_32K_EF_32K: data flash size is 32KB, EEPROM backup size is 32KB
      \arg        OB1CS_DF_16K_EF_48K: data flash size is 16KB, EEPROM backup size is 48KB
      \arg        OB1CS_DF_0K_EF_64K: data flash size is 0KB, EEPROM backup size is 64KB
      \arg        OB1CS_DF_EF_INVALID: data flash and EEPROM backup are invalid
      \arg        OB1CS_DF_32K_EF_0K: data flash size is 32KB, EEPROM backup size is 0KB
      \arg        OB1CS_DF_8K_EF_24K: data flash size is 8KB, EEPROM backup size is 24KB
      \arg        OB1CS_DF_0K_EF_32K: data flash size is 0KB, EEPROM backup size is 32KB
      \arg        OB1CS_DF_16K_EF_16K: data flash size is 16KB, EEPROM backup size is 16KB
      \arg        OB1CS_DF_24K_EF_8K: data flash size is 24KB, EEPROM backup size is 8KB
      \arg        OB1CS_DF_16K_EF_0K: data flash size is 16KB, EEPROM backup size is 0KB
      \arg        OB1CS_DF_4K_EF_12K: data flash size is 4KB, EEPROM backup size is 12KB
      \arg        OB1CS_DF_0K_EF_16K: data flash size is 0KB, EEPROM backup size is 16KB
      \arg        OB1CS_DF_8K_EF_8K: data flash size is 8KB, EEPROM backup size is 8KB
      \arg        OB1CS_DF_12K_EF_4K: data flash size is 12KB, EEPROM backup size is 4KB
    \param[in]  epsize: EPSIZE value to be programmed
                only one parameter can be selected which is shown as below:
      \arg        OB1CS_EPSIZE_NONE: no EEPROM
      \arg        OB1CS_EPSIZE_4K: 4KB EEPROM
      \arg        OB1CS_EPSIZE_2K: 2KB EEPROM
      \arg        OB1CS_EPSIZE_1K: 1KB EEPROM
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: BOR/POR or system reset during flash erase/program error
      \arg        FMC_RSTERR: BOR/POR or system reset during flash erase/program error
      \arg        FMC_OB1_LK: option bytes 1 is locked
*/
fmc_state_enum ob1_eeprom_parameter_config(uint32_t efalc, uint32_t epsize)
{
    uint32_t reg;
    fmc_state_enum fmc_state;

    /* check the option bytes security protection value */
    if(0U != (FMC_OB1CS & FMC_OB1CS_OB1LK)) {
        return FMC_OB1_LK;
    }
    /* configure the EFALC and EPSIZE */
    reg = FMC_OB1CS;
    reg &= ~FMC_OB1CS_EFALC;
    reg |= efalc;
    reg &= ~FMC_OB1CS_EPSIZE;
    reg |= epsize;

    /* wait for the FMC ready */
    fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* write the value to EPSIZE and EFALC in FMC_OB1CS register */
        FMC_OB1CS = reg;

        /* set the OB1START bit */
        FMC_OB1CS |= FMC_OB1CS_OB1START;

        /* wait for the FMC ready */
        fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the OB1START bit */
        FMC_OB1CS &= ~FMC_OB1CS_OB1START;
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      get data flash size in byte unit
    \param[in]  none
    \param[out] none
    \retval     data flash byte count
*/
uint32_t dflash_size_get(void)
{
    uint32_t efalc_value;
    uint32_t dflash_size = 0U;

    /* get EFALC value in option bytes 1 */
    efalc_value = FMC_OB1CS & FMC_OB1CS_EFALC;

    switch(efalc_value) {
    case OB1CS_DF_64K_EF_0K:
        dflash_size = 64U * 0x400U;
        break;
    case OB1CS_DF_48K_EF_16K:
        dflash_size = 48U * 0x400U;
        break;
    case OB1CS_DF_32K_EF_32K:
        dflash_size = 32U * 0x400U;
        break;
    case OB1CS_DF_16K_EF_48K:
        dflash_size = 16U * 0x400U;
        break;
    case OB1CS_DF_0K_EF_64K:
        dflash_size = 0x00000000U;
        break;
    case OB1CS_DF_EF_INVALID:
        dflash_size = 0xFFFFFFFFU;
        break;
    case OB1CS_DF_32K_EF_0K:
        dflash_size = 32U * 0x400U;
        break;
    case OB1CS_DF_8K_EF_24K:
        dflash_size = 8U * 0x400U;
        break;
    case OB1CS_DF_0K_EF_32K:
        dflash_size = 0x00000000U;
        break;
    case OB1CS_DF_16K_EF_16K:
        dflash_size = 16U * 0x400U;
        break;
    case OB1CS_DF_24K_EF_8K:
        dflash_size = 24U * 0x400U;
        break;
    case OB1CS_DF_16K_EF_0K:
        dflash_size = 16U * 0x400U;
        break;
    case OB1CS_DF_4K_EF_12K:
        dflash_size = 4U * 0x400U;
        break;
    case OB1CS_DF_0K_EF_16K:
        dflash_size = 0x00000000U;
        break;
    case OB1CS_DF_8K_EF_8K:
        dflash_size = 8U * 0x400U;
        break;
    case OB1CS_DF_12K_EF_4K:
        dflash_size = 12U * 0x400U;
        break;
    default:
        break;
    }

    return dflash_size;
}

/*!
    \brief      get EEPROM backup size in byte unit
    \param[in]  none
    \param[out] none
    \retval     EEPROM backup byte count
*/
uint32_t eeprom_backup_size_get(void)
{
    uint32_t efalc_value;
    uint32_t eeprom_backup_size = 0U;

    /* get EFALC value in option bytes 1 */
    efalc_value = FMC_OB1CS & FMC_OB1CS_EFALC;

    switch(efalc_value) {
    case OB1CS_DF_64K_EF_0K:
        eeprom_backup_size = 0x00000000U;
        break;
    case OB1CS_DF_48K_EF_16K:
        eeprom_backup_size = 16U * 0x400U;
        break;
    case OB1CS_DF_32K_EF_32K:
        eeprom_backup_size = 32U * 0x400U;
        break;
    case OB1CS_DF_16K_EF_48K:
        eeprom_backup_size = 48U * 0x400U;
        break;
    case OB1CS_DF_0K_EF_64K:
        eeprom_backup_size = 64U * 0x400U;
        break;
    case OB1CS_DF_EF_INVALID:
        eeprom_backup_size = 0xFFFFFFFFU;
        break;
    case OB1CS_DF_32K_EF_0K:
        eeprom_backup_size = 0x00000000U;
        break;
    case OB1CS_DF_8K_EF_24K:
        eeprom_backup_size = 24U * 0x400U;
        break;
    case OB1CS_DF_0K_EF_32K:
        eeprom_backup_size = 32U * 0x400U;
        break;
    case OB1CS_DF_16K_EF_16K:
        eeprom_backup_size = 16U * 0x400U;
        break;
    case OB1CS_DF_24K_EF_8K:
        eeprom_backup_size = 8U * 0x400U;
        break;
    case OB1CS_DF_16K_EF_0K:
        eeprom_backup_size = 0x00000000U;
        break;
    case OB1CS_DF_4K_EF_12K:
        eeprom_backup_size = 12U * 0x400U;
        break;
    case OB1CS_DF_0K_EF_16K:
        eeprom_backup_size = 16U * 0x400U;
        break;
    case OB1CS_DF_8K_EF_8K:
        eeprom_backup_size = 8U * 0x400U;
        break;
    case OB1CS_DF_12K_EF_4K:
        eeprom_backup_size = 4U * 0x400U;
        break;
    default:
        break;
    }

